import React from 'react';
import Avatar from '../Avatar/Avatar';
import { Link } from 'react-router-dom';

const PostContent = ({ post }) => {
    function TimePublication(date) {
        const diffTimeMs = Date.now() - date;
        const diffTimeSec = diffTimeMs / 1000;
        if (diffTimeSec < 5) {
            return 'Только что';
        }
        if (diffTimeSec < 60) {
            return `${Math.round(diffTimeSec)} сек.`;
        }
        const diffTimeMin = diffTimeSec / 60;
        if (diffTimeMin < 60) {
            return `${Math.round(diffTimeMin)} мин.`;
        }
        const diffTimeHours = diffTimeMin / 60;
        if (diffTimeHours < 24) {
            return `${Math.round(diffTimeHours)} ч.`;
        }
        const diffTimeDays = diffTimeHours / 24;
        return `${Math.round(diffTimeDays)} дн.`;
    }

    return (
        <Link to={`/posts/${post.id}`} state={post} className="post__wrapper">
            <div className="post__header">
                <Avatar />
                <div className="post__person">
                    <div className="post__name">
                        Иван Иванов
                    </div>
                    <div className="post__info">
                        <div className="post__group">
                            <svg enableBackground="new 0 0 462.982 462.982" viewBox="0 0 462.982 462.982" xmlns="http://www.w3.org/2000/svg">
                                <path d="m407.491 447.982h-29.215c-34.181-29.205-84.425-46.446-139.285-47.889v-44.251l34.526-34.526c6.316 1.174 12.714 1.758 19.124 1.758 29.535 0 59.213-12.213 81.29-34.29 27.914-27.914 40.055-67.971 31.687-104.538-.642-2.805-2.833-4.996-5.638-5.638-36.567-8.368-76.624 3.774-104.538 31.687-26.869 26.868-39.115 64.986-32.532 100.415l-23.919 23.919v-138.292l22.526-22.526c4.353.743 8.756 1.109 13.163 1.109 22.002 0 44.097-9.086 60.526-25.516 20.778-20.777 29.811-50.615 23.574-77.869-.642-2.806-2.833-4.996-5.638-5.638-27.254-6.235-57.091 2.796-77.869 23.574-19.738 19.738-28.867 47.649-24.386 73.756l-11.896 11.896v-14.505c0-23.155-8.944-44.929-25.181-61.402 4.458-26.091-4.672-53.977-24.396-73.701-20.778-20.778-50.613-29.81-77.87-23.574-2.805.642-4.996 2.833-5.638 5.638-6.237 27.253 2.796 57.091 23.574 77.869 16.431 16.431 38.523 25.516 60.526 25.516 4.424 0 8.846-.37 13.217-1.119 13.39 13.637 20.767 31.636 20.767 50.774v110.009l-23.919-23.919c6.583-35.428-5.664-73.546-32.532-100.415-27.914-27.915-67.972-40.057-104.538-31.687-2.805.642-4.996 2.833-5.638 5.638-8.368 36.567 3.773 76.624 31.687 104.538 22.079 22.079 51.753 34.29 81.29 34.29 6.408 0 12.808-.585 19.124-1.759l34.527 34.527v108.251c-54.86 1.443-105.104 18.684-139.285 47.889h-29.215c-4.142 0-7.5 3.358-7.5 7.5s3.358 7.5 7.5 7.5h352c4.142 0 7.5-3.358 7.5-7.5s-3.358-7.499-7.5-7.499zm-101.442-227.081c23.096-23.095 55.608-33.816 85.888-28.612 5.206 30.283-5.516 62.792-28.612 85.888-20.695 20.694-48.947 31.445-76.383 29.714l70.019-70.019c2.929-2.929 2.929-7.678 0-10.606-2.929-2.929-7.678-2.929-10.606 0l-70.019 70.019c-1.732-27.438 9.019-55.69 29.713-76.384zm-20.169-120.822c15.947-15.947 38.228-23.549 59.171-20.451 3.096 20.941-4.503 43.223-20.451 59.171-13.433 13.433-31.359 20.942-49.196 21.125l43.139-43.139c2.929-2.929 2.929-7.678 0-10.606-2.929-2.929-7.678-2.929-10.606 0l-43.185 43.185c.16-17.865 7.672-35.829 21.128-49.285zm-166.243-84.408c20.943-3.094 43.223 4.503 59.171 20.451 13.433 13.433 20.942 31.361 21.125 49.196l-43.139-43.139c-2.929-2.929-7.678-2.929-10.606 0-2.929 2.929-2.929 7.678 0 10.606l43.185 43.185c-17.864-.159-35.829-7.672-49.285-21.128-15.948-15.948-23.547-38.23-20.451-59.171zm-19.98 198.506c-23.096-23.096-33.817-55.605-28.612-85.888 30.281-5.206 62.792 5.517 85.888 28.612 20.694 20.694 31.444 48.946 29.713 76.383l-70.019-70.019c-2.929-2.929-7.678-2.929-10.606 0-2.929 2.929-2.929 7.678 0 10.606l70.019 70.019c-27.435 1.732-55.688-9.019-76.383-29.713zm131.834 200.805c45.67 0 89.544 12.102 121.709 33h-243.418c32.165-20.899 76.039-33 121.709-33z" />
                            </svg>
                            <span> Основатель группы </span>
                        </div>
                        <div className="post__time">
                            {TimePublication(post.created)}
                        </div>
                    </div>
                    <button type='button' className='post__settings'>
                        <i className="fa fa-chevron-right" aria-hidden="true"></i>
                    </button>
                </div>
            </div>
            <div className="post__content">
                {post.content}
            </div>
            <div className="post__buttons">
                <button className="post__button" type='button'>
                    <i className="fa fa-thumbs-o-up" aria-hidden="true"></i> Нравится
                </button>
                <button className="post__button" type='button'>
                    <i className="fa fa-comment-o" aria-hidden="true"></i> Комментировать
                </button>
            </div>
        </Link>
    );
}

export default PostContent;